# THIS FILE IS AUTOMATICALLY GENERATED
# Project: F:\Programme_Scripts\PSOC Creator\FreeRTOS\FreeRTOS_CY8CKIT_059-master\FreeRTOS_Demo.cydsn\FreeRTOS_Demo.cyprj
# Date: Sat, 20 Oct 2018 15:11:25 GMT
#set_units -time ns
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 13.333333333333332 -waveform {0 6.66666666666667} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 13.333333333333332 -waveform {0 6.66666666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 11 21} -nominal_period 133.33333333333331 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 75 151} -nominal_period 999.99999999999989 [list [get_pins {ClockBlock/dclk_glb_1}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for F:\Programme_Scripts\PSOC Creator\FreeRTOS\FreeRTOS_CY8CKIT_059-master\FreeRTOS_Demo.cydsn\TopDesign\TopDesign.cysch
# Project: F:\Programme_Scripts\PSOC Creator\FreeRTOS\FreeRTOS_CY8CKIT_059-master\FreeRTOS_Demo.cydsn\FreeRTOS_Demo.cyprj
# Date: Sat, 20 Oct 2018 15:11:19 GMT
